Tester/src/Catalogs/UserGroups/UserGroups.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>UserGroups</name>
  <predefined>
    <items>
      <name>Users</name>
      <description>Users</description>
    </items>
  </predefined>
  <tabularSections>
    <name>Rights</name>
    <attributes>
      <name>RoleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Tester/src/InformationRegisters/UsersAndGroups/UsersAndGroups.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>UsersAndGroups</name>
  <dimensions>
    <name>UserGroup</name>
    <comment>Нельзя использовать имя Group</comment>
    <type>
      <types>CatalogRef.UserGroups</types>
    </type>
  </dimensions>
  <dimensions>
    <name>User</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Tester/src/Catalogs/UserGroups/ObjectModule.bsl
var ObjectRef;

Procedure BeforeWrite ( Cancel )
	
	if ( DataExchange.Load ) then
		return;
	endif; 
	makeUsersAndGroups ();
	
EndProcedure

Procedure makeUsersAndGroups ()
	
	selectedUsers = undefined;
	if ( not AdditionalProperties.Property ( "SelectedUsers", selectedUsers ) ) then
		return;
	endif; 
	recordset = InformationRegisters.UsersAndGroups.CreateRecordSet ();
	if ( IsNew () ) then
		SetNewObjectRef ( Catalogs.UserGroups.GetRef ( new UUID () ) );
		ObjectRef = GetNewObjectRef ();
	else
		ObjectRef = Ref;
	endif; 
	recordset.Filter.UserGroup.Set ( ObjectRef );
	for each row in selectedUsers do
		movement = recordset.Add ();
		movement.UserGroup = ObjectRef;
		movement.User = row.User;
	enddo; 
	recordset.Write ();
	
EndProcedure 

Procedure OnWrite ( Cancel )
	
	if ( DataExchange.Load ) then
		return;
	endif; 
	SetPrivilegedMode ( true );
	if ( LoginsSrv.LastAdministrator () ) then
		Cancel = true;
		return;
	endif; 
	setRights ();
	SetPrivilegedMode ( false );

EndProcedure

Procedure setRights ()
	
	userNames = getUserNames ();
	for each userName in userNames do
		user = InfoBaseUsers.FindByName ( userName );
		if ( user = undefined ) then
			continue;
		endif; 
		LoginsSrv.SetRights ( user );
		user.Write ();
	enddo; 
	
EndProcedure 

Function getUserNames ()
	
	s = "
	|select UsersAndGroups.User.Description as UserName
	|from InformationRegister.UsersAndGroups as UsersAndGroups
	|where UsersAndGroups.UserGroup = &Ref
	|";
	q = new Query ( s );
	q.SetParameter ( "Ref", Ref );
	return q.Execute ().Unload ().UnloadColumn ( "UserName" );
	
EndFunction
